## Fetching Dataset

In [1]:
# from google.colab import drive

# drive.mount("/content/drive")

In [2]:
import numpy as np, pandas as pd

In [3]:
dataset = pd.read_csv("Dataset/Social_Network_Ads.csv")

In [4]:
dataset.head(5)

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [5]:
dataset.tail(5)

      User ID  Gender  Age  EstimatedSalary  Purchased
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

In [6]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510    Male   19            19000          0
1    15810944    Male   35            20000          0
2    15668575  Female   26            43000          0
3    15603246  Female   27            57000          0
4    15804002    Male   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863  Female   46            41000          1
396  15706071    Male   51            23000          1
397  15654296  Female   50            20000          1
398  15755018    Male   36            33000          0
399  15594041  Female   49            36000          1

[400 rows x 5 columns]

In [7]:
dataset.shape

(400, 5)

In [8]:
print("The dataset has a total of " + str(dataset.shape[0]) + " rows and " + str(dataset.shape[1]) + " columns.")

The dataset has a total of 400 rows and 5 columns.

In [9]:
dat_columns = dataset.columns
dat_columns

Index(['User ID', 'Gender', 'Age', 'EstimatedSalary', 'Purchased'], dtype='object')

### Investigating Dataset

In [10]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 400 entries, 0 to 399
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   User ID          400 non-null    int64
 1   Gender           400 non-null    object
 2   Age              400 non-null    int64
 3   EstimatedSalary  400 non-null    int64
 4   Purchased        400 non-null    int64
dtypes: int64(4), object(1)
memory usage: 15.8+ KB

In [11]:
dataset.describe()

            User ID         Age  EstimatedSalary   Purchased
count  4.000000e+02  400.000000       400.000000  400.000000
mean   1.569154e+07   37.655000     69742.500000    0.357500
std    7.165832e+04   10.482877     34096.960282    0.479864
min    1.556669e+07   18.000000     15000.000000    0.000000
25%    1.562676e+07   29.750000     43000.000000    0.000000
50%    1.569434e+07   37.000000     70000.000000    0.000000
75%    1.575036e+07   46.000000     88000.000000    1.000000
max    1.581524e+07   60.000000    150000.000000    1.000000

In [12]:
dataset["Age"].mean()

37.655

In [13]:
dataset.nunique()

User ID            400
Gender               2
Age                 43
EstimatedSalary    117
Purchased            2
dtype: int64

In [14]:
dataset["Gender"].value_counts()

Female    204
Male      196
Name: Gender, dtype: int64

In [15]:
dataset["Purchased"].value_counts()

0    257
1    143
Name: Purchased, dtype: int64

In [16]:
dataset[(dataset["Gender"] == "Male") & (dataset["Purchased"] == 0)]

      User ID Gender  Age  EstimatedSalary  Purchased
0    15624510   Male   19            19000          0
1    15810944   Male   35            20000          0
4    15804002   Male   19            76000          0
5    15728773   Male   27            58000          0
8    15600575   Male   25            33000          0
..        ...    ...  ...              ...        ...
359  15709183   Male   42            54000          0
368  15779744   Male   38            71000          0
380  15683758   Male   42            64000          0
387  15627220   Male   39            71000          0
398  15755018   Male   36            33000          0

[130 rows x 5 columns]

## Encoding Data

In [17]:
from sklearn.preprocessing import LabelEncoder

In [18]:
le = LabelEncoder()
dataset["Gender"] = le.fit_transform(dataset["Gender"])

In [19]:
dataset

      User ID  Gender  Age  EstimatedSalary  Purchased
0    15624510       1   19            19000          0
1    15810944       1   35            20000          0
2    15668575       0   26            43000          0
3    15603246       0   27            57000          0
4    15804002       1   19            76000          0
..        ...     ...  ...              ...        ...
395  15691863       0   46            41000          1
396  15706071       1   51            23000          1
397  15654296       0   50            20000          1
398  15755018       1   36            33000          0
399  15594041       0   49            36000          1

[400 rows x 5 columns]

In [20]:
# dataset["Gender"] = dataset["Gender"].map({"Male": 0, "Female": 1})

## Splitting Input & Output Data

In [21]:
x = dataset.iloc[:, [1, 2, 3]]
y = dataset.iloc[:, -1]

In [22]:
x

     Gender  Age  EstimatedSalary
0         1   19            19000
1         1   35            20000
2         0   26            43000
3         0   27            57000
4         1   19            76000
..      ...  ...              ...
395       0   46            41000
396       1   51            23000
397       0   50            20000
398       1   36            33000
399       0   49            36000

[400 rows x 3 columns]

In [23]:
y

0      0
1      0
2      0
3      0
4      0
      ..
395    1
396    1
397    1
398    0
399    1
Name: Purchased, Length: 400, dtype: int64

## Splitting Train and Test Set

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
X_train, X_test, Y_train, Y_test = train_test_split(x, y, test_size=0.2, random_state=0)

In [26]:
print(X_train.shape)
print(X_test.shape)
print(Y_train.shape)
print(Y_test.shape)

(320, 3)
(80, 3)
(320,)
(80,)

In [27]:
X_train

     Gender  Age  EstimatedSalary
336       1   58           144000
64        0   59            83000
55        0   24            55000
106       0   26            35000
300       0   58            38000
..      ...  ...              ...
323       0   48            30000
192       1   29            43000
117       1   36            52000
47        0   27            54000
172       0   26           118000

[320 rows x 3 columns]

In [28]:
X_test

     Gender  Age  EstimatedSalary
132       1   30            87000
309       0   38            50000
341       1   35            75000
196       0   30            79000
246       0   35            50000
..      ...  ...              ...
14        1   18            82000
363       0   42            79000
304       0   40            60000
361       0   53            34000
329       0   47           107000

[80 rows x 3 columns]

## Scaling Data

In [29]:
from sklearn.preprocessing import MinMaxScaler, StandardScaler

\(X_{scaled}=(X-X_{min})/(X_{max}-X_{min})\)

In [30]:
sc = MinMaxScaler()
X_train[["Age"]] = sc.fit_transform(X_train[["Age"]])
X_test[["Age"]] = sc.fit_transform(X_test[["Age"]])
X_train[["EstimatedSalary"]] = sc.fit_transform(X_train[["EstimatedSalary"]])
X_test[["EstimatedSalary"]] = sc.fit_transform(X_test[["EstimatedSalary"]])

In [31]:
X_test

     Gender       Age  EstimatedSalary
132       1  0.285714         0.533333
309       0  0.476190         0.259259
341       1  0.404762         0.444444
196       0  0.285714         0.474074
246       0  0.404762         0.259259
..      ...       ...              ...
14        1  0.000000         0.496296
363       0  0.571429         0.474074
304       0  0.523810         0.333333
361       0  0.833333         0.140741
329       0  0.690476         0.681481

[80 rows x 3 columns]

\(Z=(X-\mu )/\sigma \), \sigma = √[ Σ (x_i - \mu)² / N ]

In [32]:
# sc = StandardScaler()
# X_train[["Age"]] = sc.fit_transform(X_train[["Age"]])
# X_test[["Age"]] = sc.fit_transform(X_test[["Age"]])
# X_train[["EstimatedSalary"]] = sc.fit_transform(X_train[["EstimatedSalary"]])
# X_test[["EstimatedSalary"]] = sc.fit_transform(X_test[["EstimatedSalary"]])

In [33]:
# X_test

## Classification

In [34]:
from sklearn.neighbors import KNeighborsClassifier

In [35]:
classifier = KNeighborsClassifier(n_neighbors=5, metric="euclidean")
classifier.fit(X_train, Y_train)

KNeighborsClassifier(metric='euclidean')

In [36]:
Y_pred = classifier.predict(X_test)
Y_pred

array([0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1], dtype=int64)

In [37]:
print(list(Y_pred))

[0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1]

In [38]:
print(list(Y_test))

[0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 1, 1]

## Evaluation

In [39]:
from sklearn.metrics import classification_report, confusion_matrix, accuracy_score

In [40]:
print("Classification Report: ")
print(classification_report(Y_test, Y_pred))
print("\nConfusion Matrix: ")
print(confusion_matrix(Y_test, Y_pred))

Classification Report:
              precision    recall  f1-score   support

           0       0.98      0.95      0.96        58
           1       0.88      0.95      0.91        22

    accuracy                           0.95        80
   macro avg       0.93      0.95      0.94        80
weighted avg       0.95      0.95      0.95        80


Confusion Matrix:
[[55  3]
 [ 1 21]]

In [41]:
ac = accuracy_score(Y_test, Y_pred)

In [42]:
print(ac)

0.95